In [1]:
import pandas as pd
from pandasql import sqldf

In [2]:
id_attr = [1,2,3,4]
name_attr = ['Joe', 'Henry', 'Sam', 'Max']
salary = [70000, 80000, 60000, 90000]
manager_id = [3,4, 'NULL', 'NULL']

dict1 = {'ID' : id_attr, 'ame': name_attr, 'salary': salary, 'manager_id':manager_id}

In [3]:
df2 = pd.DataFrame(dict1)

df2

   ID    ame  salary manager_id
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       NULL
3   4    Max   90000       NULL

In [4]:
id_attr = [1,2,3]
email = ['john@example.com', 'bob@example.com', 'john@example.com']
dict3 = { 'ID' : id_attr, 'email' : email}

df3 = pd.DataFrame(dict3)
df3.head()

   ID             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [5]:
q = 'select id, email from df3 group by email having count(email) >= 1'
sqldf(q, globals())

   ID             email
0   2   bob@example.com
1   1  john@example.com

In [9]:
students = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I']
courses = ['Math', 'English', 'Math', 'Biology', 'Math', 'Computer', 'Math', 'Math', 'Math']

dict4 = { 'student' : students, 'courses' : courses}

df4 = pd.DataFrame(dict4)
df4

  student   courses
0       A      Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

In [13]:
q = 'select courses from df4 group by courses having count(courses)>=5'
sqldf(q, globals())

  courses
0    Math

In [15]:
player_id = [1,1,2,3,3]
device_id = [2,2,3,1,4]
event_date = ['2016-03-01', '2016-05-02', '2017-06-25', '2016-03-02', '2018-07-03']
games_played = [5,6,1,0,5]

dict5 = { 'player_id':player_id, 'device_id':device_id, 'event_date':event_date, 'games_played':games_played }

df5 = pd.DataFrame(dict5)
df5

   player_id  device_id  event_date  games_played
0          1          2  2016-03-01             5
1          1          2  2016-05-02             6
2          2          3  2017-06-25             1
3          3          1  2016-03-02             0
4          3          4  2018-07-03             5

In [19]:
q = 'select DISTINCT(player_id), event_date from df5'
sqldf(q, globals())

   player_id  event_date
0          1  2016-03-01
1          1  2016-05-02
2          2  2017-06-25
3          3  2016-03-02
4          3  2018-07-03